# Boolean Indexing------------------------------
- series / DataFrame 객체에서 빠르게 원하는 원소를 추출하기 위해 사용

- series / DataFrame 객체의 원소에 연산 후 True/False인 결과

In [104]:
# 모듈 로딩 ---------------------------------------------------
import pandas as pd

# DF 객체 생성 ----------------------------------------------------------------------
df = pd. DataFrame({'name':["Park","Kim","Lee"],
                    'age':[10,21,16],
                    'gender':['F','F','M']})

In [105]:
df

   name  age gender
0  Park   10      F
1   Kim   21      F
2   Lee   16      M

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [107]:
# age 컬럼 + 비교연산 => 15세 이상
df['age']

0    10
1    21
2    16
Name: age, dtype: int64

In [108]:
ageCol=df["age"]
ageCol

0    10
1    21
2    16
Name: age, dtype: int64

In [109]:
result1=df['age']>15   # ageCol 원소마다 >15 
result1

0    False
1     True
2     True
Name: age, dtype: bool

In [110]:
# [ 예제 실습 ] age가 15세 이상인 데이터만 추출-----------------------------------------------------------
df[result1]

  name  age gender
1  Kim   21      F
2  Lee   16      M

In [111]:
df[ageCol>15]

  name  age gender
1  Kim   21      F
2  Lee   16      M

In [112]:
# [ 예제 실습 ] 성별이 남자인 데이터 추출하기----------------------------------------------------
result2=df['gender']=='M'

In [113]:
df[result2]

  name  age gender
2  Lee   16      M

In [114]:
# [ 예제 실습 ] 15세 이상 남자만 추출하기---------------------------------------------------------
df[result1 & result2]

  name  age gender
2  Lee   16      M

In [115]:
result = ((df['gender']=='M') & (df['age']>15)) 
df[result]

  name  age gender
2  Lee   16      M

In [124]:
genCol=df['gender']
genM=df[genCol=='M']
ageCol=genM['age']
result=genM[ageCol>15]
result

  name  age gender
2  Lee   16      M

In [123]:
gender = df[df['gender']=='F']
result= gender[df['age']>15]
result

C:\Users\minsu\AppData\Local\Temp\ipykernel_185984\3558281575.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  result= gender[df['age']>15]

  name  age gender
1  Kim   21      F